# Завдання:
# 1. Створи список з кількох чисел і рядків.
# 2. Додай новий елемент до списку.
# 3. Видали один з елементів списку.
# 4. Зміни значення одного з елементів.
# 5. Виведи остаточний список на екран.

my_list = [1, 2, 3, "Margaret", "Tanya", 246, 80]
my_list.append(1090)
my_list.remove(1)
my_list[2] = [267]
print(my_list)


#################################################


# Завдання:
# 1. Створи список, який містить різні типи даних: числа, рядки, інший список, кортеж.
# 2. Замінити один з елементів списку на інший список.
# 3. Знайти максимальне число в списку (включаючи числа всередині вкладених списків).
# 4. Перевірити, чи є конкретний рядок у списку, і вивести його індекс, якщо є.
# 5. Змінити всі рядки в списку на верхній регістр.

my_list_2 = [1, 2, 10, "Greetings, my dear friends.", [4, 5, 6], (7, 8), "Banana"]
my_list_2[1] = [0, 1, 2, 3]
max_int = None
for item in my_list_2:
    if isinstance(item, int):
        if max_int is None or item > max_int:
            max_int = item

print("Max integer:", max_int)

for index, item in enumerate(my_list_2):
    if "Banana" in str(item):
        print(f"Banana found at index {index}")


for i in range(len(my_list_2)):
    if isinstance(my_list_2[i], str):
        my_list_2[i] = my_list_2[i].upper()

print(my_list_2)

# enumerate() - це функція в Python, яка дозволяє перебирати елементи списку разом з їхніми індексами.
# isinstance() - це функція, яка перевіряє, чи об'єкт належить певному класу. Вона приймає
# два аргументи: об'єкт, який потрібно перевірити, і клас або тип, до якого потрібно перевірити належність.


#################################################


# Завдання: Сума парних елементів
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = 0
for num in numbers:
    if num % 2 == 0:
        result += num
print("Сума парних чисел:", result)
